; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l18_p18_c18_g18)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 medicina)
	(at-box box10 deposito)
	(box-has box10 medicina)
	(at-box box11 deposito)
	(box-has box11 medicina)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-person person1 refugio5)
	(at-person person2 refugio6)
	(at-person person3 refugio17)
	(at-person person4 refugio17)
	(at-person person5 refugio8)
	(at-person person6 refugio16)
	(at-person person7 refugio7)
	(at-person person8 refugio17)
	(at-person person9 refugio10)
	(at-person person10 refugio10)
	(at-person person11 refugio4)
	(at-person person12 refugio11)
	(at-person person13 refugio11)
	(at-person person14 refugio3)
	(at-person person15 refugio15)
	(at-person person16 refugio9)
	(at-person person17 refugio3)
	(at-person person18 refugio4)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 medicina)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person9 medicina)
	(person-has person11 comida)
	(person-has person14 comida)
	(person-has person15 comida)
	(person-has person16 medicina)
	(person-has person17 medicina)
	(person-has person18 medicina)
))
)

; plan
1. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 0 of 18
2. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 0 of 18
3. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 0 of 18
4. (leave box8 refugio5 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio5) (free dron1-der) (person-has person1 comida)
   goals met: 1 of 18
5. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 1 of 18
6. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 1 of 18
7. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 1 of 18
8. (leave box18 refugio6 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 medicina)
   added: (at-box box18 refugio6) (free dron1-izq) (person-has person2 medicina)
   goals met: 2 of 18
9. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 2 of 18
10. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 2 of 18
11. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 2 of 18
12. (move refugio8 refugio7 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio7)
   goals met: 2 of 18
13. (leave box17 refugio7 dron1-izq dron1 person7 medicina)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 medicina)
   added: (at-box box17 refugio7) (free dron1-izq) (person-has person7 medicina)
   goals met: 3 of 18
14. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 3 of 18
15. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 3 of 18
16. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 3 of 18
17. (move refugio8 refugio15 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio15)
   goals met: 3 of 18
18. (leave box7 refugio15 dron1-der dron1 person15 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio15) (free dron1-der) (person-has person15 comida)
   goals met: 4 of 18
19. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 4 of 18
20. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 4 of 18
21. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 4 of 18
22. (move refugio8 refugio9 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio9)
   goals met: 4 of 18
23. (leave box16 refugio9 dron1-izq dron1 person16 medicina)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 medicina)
   added: (at-box box16 refugio9) (free dron1-izq) (person-has person16 medicina)
   goals met: 5 of 18
24. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 5 of 18
25. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 5 of 18
26. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 5 of 18
27. (leave box6 refugio8 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio8) (free dron1-der) (person-has person5 comida)
   goals met: 6 of 18
28. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 6 of 18
29. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 6 of 18
30. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 6 of 18
31. (leave box15 refugio8 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 medicina)
   added: (at-box box15 refugio8) (free dron1-izq) (person-has person5 medicina)
   goals met: 7 of 18
32. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 7 of 18
33. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 7 of 18
34. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 7 of 18
35. (leave box5 refugio16 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio16) (free dron1-der) (person-has person6 comida)
   goals met: 8 of 18
36. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 8 of 18
37. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 8 of 18
38. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 8 of 18
39. (leave box14 refugio16 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 medicina)
   added: (at-box box14 refugio16) (free dron1-izq) (person-has person6 medicina)
   goals met: 9 of 18
40. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 9 of 18
41. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 9 of 18
42. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 9 of 18
43. (leave box13 refugio17 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 medicina)
   added: (at-box box13 refugio17) (free dron1-izq) (person-has person4 medicina)
   goals met: 10 of 18
44. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 10 of 18
45. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 10 of 18
46. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 10 of 18
47. (leave box4 refugio17 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio17) (free dron1-der) (person-has person8 comida)
   goals met: 11 of 18
48. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 11 of 18
49. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 11 of 18
50. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 11 of 18
51. (leave box12 refugio17 dron1-izq dron1 person8 medicina)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 medicina)
   added: (at-box box12 refugio17) (free dron1-izq) (person-has person8 medicina)
   goals met: 12 of 18
52. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 12 of 18
53. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 12 of 18
54. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 12 of 18
55. (leave box3 refugio10 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio10) (free dron1-der) (person-has person9 comida)
   goals met: 13 of 18
56. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 13 of 18
57. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 13 of 18
58. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 13 of 18
59. (leave box11 refugio10 dron1-izq dron1 person9 medicina)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 medicina)
   added: (at-box box11 refugio10) (free dron1-izq) (person-has person9 medicina)
   goals met: 14 of 18
60. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 14 of 18
61. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 14 of 18
62. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 14 of 18
63. (leave box2 refugio3 dron1-der dron1 person14 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio3) (free dron1-der) (person-has person14 comida)
   goals met: 15 of 18
64. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 15 of 18
65. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 15 of 18
66. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 15 of 18
67. (move refugio3 refugio4 dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 refugio4)
   goals met: 15 of 18
68. (leave box1 refugio4 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio4) (free dron1-der) (person-has person11 comida)
   goals met: 16 of 18
69. (leave box10 refugio4 dron1-izq dron1 person18 medicina)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 medicina)
   added: (at-box box10 refugio4) (free dron1-izq) (person-has person18 medicina)
   goals met: 17 of 18
70. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 17 of 18
71. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 17 of 18
72. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 17 of 18
73. (leave box9 refugio3 dron1-der dron1 person17 medicina)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 medicina)
   added: (at-box box9 refugio3) (free dron1-der) (person-has person17 medicina)
   goals met: 18 of 18
